EDT/УТ/src/Documents/ВводДанныхОМотивацииЭкипажа/ВводДанныхОМотивацииЭкипажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводДанныхОМотивацииЭкипажа</name>
  <registerRecords>InformationRegister.НУЭкипажей</registerRecords>
  <attributes>
    <name>МесяцРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СтатьиНУ</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяНУ</name>
      <type>
        <types>CatalogRef.НачисленияУдержанияЭкипажей</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасчета</name>
      <type>
        <types>EnumRef.ВариантыРасчетаНУЭкипажей</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МесяцРасчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Documents/ВводДанныхОМотивацииЭкипажа/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СтатьиНУСтатьяНУПриИзменении(Элемент)
    ТекущиеДанные = Элементы.СтатьиНУ.ТекущиеДанные;
    
    Если ТекущиеДанные <> Неопределено Тогда
        ДанныеСтавкиНУЭкипажей = smv.ПолучитьДанныеСтавкиНУЭкипажей(ТекущиеДанные.СтатьяНУ,КонецМесяца(Объект.МесяцРасчета));
        ЗаполнитьЗначенияСвойств(ТекущиеДанные,ДанныеСтавкиНУЭкипажей);
        ТекущиеДанные.ТипРасчета = ТекущиеДанные.СтатьяНУ.ВариантРасчета;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокВыбораМесяца(Год)
    
    Элементы.Месяц.СписокВыбора.Очистить();
    Элементы.Месяц.СписокВыбора.Добавить(Формат(Год-1, "ЧГ=0")); //для смены года
    Для к = 1 По 12  Цикл
        СформДата = Дата(Год, к, 1);
        Наим = Формат(СформДата, "ДФ = ММММ_гггг");
        Наим = СтрЗаменить(Наим, "_", " ");
        Элементы.Месяц.СписокВыбора.Добавить(Наим);    
    КонецЦикла;
    Элементы.Месяц.СписокВыбора.Добавить(Формат(Год+1, "ЧГ=0")); //для смены года
    

КонецПроцедуры

&НаКлиенте
Процедура МесяцНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)


    Если Месяц <> "" Тогда

        //реквизит уже заполнен, нужно формировать список для года, соответствующего заполнению
        ВыбрГод = Число(Прав(Месяц, 4));
        СформироватьСписокВыбораМесяца(ВыбрГод);
    КонецЕсли;
    
    СтандартнаяОбработка = Ложь;
    ВыбранноеЗначение = Строка(ЭтаФорма.ВыбратьИзСписка(Элемент.СписокВыбора, Элемент));
    Если ВыбранноеЗначение <> "" Тогда
        Если СтрДлина(ВыбранноеЗначение)=4 Тогда

            //выбрано значение, которое соответствует смене года в списке
            Пока СтрДлина(ВыбранноеЗначение) = 4 Цикл

                //цикл продолжается до тех пор, пока мы не выберем месяц
                ВыбрГод = Число(ВыбранноеЗначение);
                СформироватьСписокВыбораМесяца(ВыбрГод);
                ВыбранноеЗначение = Строка(ЭтаФорма.ВыбратьИзСписка(Элемент.СписокВыбора, Элемент));                    
            КонецЦикла;
        КонецЕсли;
        Если ВыбранноеЗначение <> "" Тогда

             //выбрали месяц, а не пустое значение, запишем его

            //если выбрали пустое значение, то в реквизите месяц сохранится значение, которое было до выбора
            Месяц = ВыбранноеЗначение;

            НомМесяца = (Найти("янвфевмарапрмайиюниюлавгсеноктноядек",Нрег(Лев(ВыбранноеЗначение,3)))+2)/3; //получаем номер месяца
            ВыбрГод = Число(Прав(ВыбранноеЗначение, 4));
            Объект.МесяцРасчета = НачалоМесяца(Дата(ВыбрГод, НомМесяца, 1));


        КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Если ЗначениеЗаполнено(Объект.МесяцРасчета) Тогда
        Месяц = Формат(Объект.МесяцРасчета, "ДФ = ММММ_гггг");

        //формируем список на год, соответствующий заполненному реквизиту

        СформироватьСписокВыбораМесяца(Год(Объект.МесяцРасчета));
    Иначе
        Месяц = ""; 

        //формируем список на текущий год

        СформироватьСписокВыбораМесяца(Год(ТекущаяДата()));
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.МесяцРасчета = НачалоМесяца(ТекущаяДата());	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиНУПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы.СтатьиНУ.ТекущиеДанные;
	ТекДанные.МесяцРасчета = Объект.МесяцРасчета;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.МесяцРасчета = НачалоМесяца(Объект.Дата);
	Месяц = Формат(Объект.МесяцРасчета, "ДФ = ММММ_гггг");
			
КонецПроцедуры

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	
	
	
	//Если Месяц <> "" Тогда

	//  	//если выбрали пустое значение, то в реквизите месяц сохранится значение, которое было до выбора
	//    Месяц = ВыбранноеЗначение;

	//    НомМесяца = (Найти("янвфевмарапрмайиюниюлавгсеноктноядек",Нрег(Лев(ВыбранноеЗначение,3)))+2)/3; //получаем номер месяца
	//    ВыбрГод = Число(Прав(ВыбранноеЗначение, 4));
	//    Объект.МесяцРасчета = НачалоМесяца(Дата(ВыбрГод, НомМесяца, 1));


	//КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	
	Если ВыбранноеЗначение <> "" Тогда

      	//если выбрали пустое значение, то в реквизите месяц сохранится значение, которое было до выбора
        Месяц = ВыбранноеЗначение;

        НомМесяца = (Найти("янвфевмарапрмайиюниюлавгсеноктноядек",Нрег(Лев(ВыбранноеЗначение,3)))+2)/3; //получаем номер месяца
        ВыбрГод = Число(Прав(ВыбранноеЗначение, 4));
        Объект.МесяцРасчета = НачалоМесяца(Дата(ВыбрГод, НомМесяца, 1));


    КонецЕсли;
	
КонецПроцедуры
